CREATE DATABASE IF NOT EXISTS cinemadb;
USE cinemadb;

CREATE TABLE IF NOT EXISTS Users(
UserId INT UNIQUE AUTO_INCREMENT,
Login VARCHAR(255) NOT NULL UNIQUE,
Password VARCHAR(100) NOT NULL,
Role VARCHAR(45) NOT NULL ,
FirstName VARCHAR(45) NOT NULL,
SecondName VARCHAR(45) NOT NULL,
Phone VARCHAR(20) NOT NULL UNIQUE,
Email VARCHAR(30) NOT NULL UNIQUE,
Cash INT NOT NULL
CONSTRAINT PK_User PRIMARY KEY (UserId,Login)
);

CREATE TABLE IF NOT EXISTS Movies(
MovieId INT PRIMARY KEY AUTO_INCREMENT,
Name VARCHAR(30) NOT NULL,
Description TEXT, 
Price INT,
Duration TIME,
Genre VARCHAR(20),
AgeLimit INT,
Dimension VARCHAR(10),
Production VARCHAR(20),
GraduationYear YEAR,
Producer VARCHAR(60),
Scenario VARCHAR(60),
Staring VARCHAR(200)
);

CREATE TABLE IF NOT EXISTS Timetable(
SeansID INT PRIMARY KEY AUTO_INCREMENT,
Time TIMESTAMP,
Movie_id INT,
Price INT,
Visible BOOL,
CONSTRAINT timetable_movie_fk 
    FOREIGN KEY (Movie_id) REFERENCES Movies (Id)
);

CREATE TABLE IF NOT EXISTS Seats(
SeatID INT PRIMARY KEY AUTO_INCREMENT,
SeatRow TINYINT,
SeatCol TINYINT
);

CREATE TABLE IF NOT EXISTS Tickets(
TicketID INT PRIMARY KEY AUTO_INCREMENT,
SeatID INT,
SeansID INT,
CONSTRAINT ticket_timetable_fk 
    FOREIGN KEY (SeansID) REFERENCES Timetable (SeansID),
CONSTRAINT ticket_seats_fk 
    FOREIGN KEY (SeatID) REFERENCES Seats (SeatID)
);

CREATE TABLE IF NOT EXISTS Statuses_of_seats(
StatusID INT PRIMARY KEY AUTO_INCREMENT, 
SeansID INT,
SeatID INT,
Status INT,
User VARCHAR(255),
CONSTRAINT seatstatus_timetable_fk 
    FOREIGN KEY (SeansID) REFERENCES Timetable (SeansID),
CONSTRAINT seatstatus_seats_fk 
    FOREIGN KEY (SeatID) REFERENCES Seats (SeatID),
CONSTRAINT seatstatus_user_fk 
    FOREIGN KEY (User) REFERENCES Users (Login)
);


INSERT INTO cinemadb . Movies(`Name`, `Description`, `Price`, `Duration`, `Genre`, `AgeLimit`, `Dimension`, `Production`, `GraduationYear`, `Producer`, `Scenario`, `Staring`)
VALUES ('Люди в чорному: Інтернешнл','Ви навіть про це не підозрюєте, але існує таємна організація, яка охороняє Землю від різного роду інопланетян і дивних істот. Це Люди в чорному. Як не складно здогадатися, вони майже завжди в чорних ділових костюмах. У них є свої агенти в усіх великих містах на нашій планеті. У кожного з Людей в чорному є нереально круті стволи та пристосування, які допомагають стежити за порядком на Землі, щоб інопланетяни не турбували людей. Час від часу там навіть проводиться набір новачків – так у пару до Агента Н потрапила Агент М. Ці двоє точно добре спрацюються, адже це так весело стріляти по монстрам. Буде багато драйву.','50','1:40:00','бойовик, фантастика','12','3D','США','2019','Лорі МакДональд, Уолтер Ф. Паркс','Метт Холлоуей, Артур Маркам','Кріс Хемсворт, Тесса Томпсон, Ребекка Ферґюсон, Ліам Нісон, Емма Томпсон, Рейф Сполл'),
       ('Подорож хорошого пса','Це історія про справжню відданість собаки. Для Бейлі Ітан не просто господар, а друг на все життя. На жаль, пси живуть набагато менше, ніж люди. Але це ніколи не заважало Бейлі знаходити Ітана в тілі нового собаки. Тер\'єр, бульдог або дворняга – ким би він не був, завжди знаходив свого друга. І головне, що Ітан завжди впізнавав свого вихованця. Але роки йдуть, у чоловіка вже є внучка Сі Джей – тепер Бейлі повинен піклуватися про дівчинку. Як мінімум, так попросив Ітан, та й сам пес перейнявся любов\'ю до Сі Джей. Кожен раз, коли він буде перероджуватися, знайде свою дівчинку та робитиме її життя трохи кращим і спокійнішим.','50','1:30:00','пригоди, сімейний','3','2D','США','2019','Гейл Манкусо','В. Брюс Камерон, Майя Форбс','Денніс Куейд, Бетті Джілпін, Джош Ґед, Джейк Менлі, Єн Чен'),
       ('Історія іграшок 4','Найвідоміші аніматори світу, оскароносні Disney\Pixar запрошують на зустріч з улюбленими героями! З переїздом у новий дім життя ковбоя Вуді і космічного рейнджера Базза перевертається з ніг на голову. Залишивши турботи, герої змушені об’єднатися, щоб вирушити у захопливу і небезпечну мандрівку, рівної якій ще не було у світі Іграшок!','50','1:30:00','комедія, пригоди','3','3D','США','2019','Джош Кулі','Рашида Джонс, Вілл МакКормак','Том Хенкс, Джоан Кьюсак, Тім Аллен, Патриція Аркетт, Джефф Ґарлін, Лорі Меткаф, Бонні Гант'),
       ('Ма','Шокуючий психологічний трилер відкриває темну сторону звичайної людини. Група підлітків планує вечірку. І коли незнайомка пропонує їм свій будинок для тусні – одразу погоджуються. Вони не підозрюють, яка страшна таємниця з минулого ховається за цим запрошенням.','50','1:40:00','жахи, трилер','16','2D','США','2019','Джейсон Блум','Скотті Лендіс','	Октавія Спенсер, Міссі Пайл, Люк Еванс, Джульєтт Льюїс, Еллісон Дженні'),
       ('Вчора','Джек Малик - бідний музикант, без гроша в кишені, перебивався випадковими заробітками і виступами в дешевих пабах. Все змінюється однієї ночі, коли під час глобального відключення електрики його збиває автобус. Джек виживає і приходить до тями в знайомому, але дуже дивному світі - тут ніколи не існувало групи The Beatles.','50','1:30:00','фентезі, музика','12','2D','США','2019','Бернард Беллью, Тім Беван','Річард Кертіс','Гімеш Патель, Лілі Джеймс, Ана Де Армас, Кейт МакКіннон, Ламорн Морріс, Мар\'яна Співа'),
       ('Дитя робота','Весь світ недавно пережив страшний апокаліпсис, через що загинуло все людство. Вся надія на відродження нашого роду лежить на плечах робота, який в підземному бункері з ембріонів може виростити дітей. Так і сталося з дівчинкою без імені. Вона виросла в бункері, і єдиною, хто завжди перебувала поруч, була її мати. Саме так дочка називає робота, який її виростив і який нею опікувався так багато років. Дівчинка завжди думала, що вона єдина, хто залишився в живих. Коли ж в бункер, де живуть мати і дочка, стукає незнайома жінка, все це змінюється. Вона каже, що зовнішній світ зовсім не такий, яким його описує робот. Дівчинка повинна сама вибрати, кому вірити, а кому ні.','50','1:55:00','фантастика, трилер','16','2D','Австралія','2019','Келвін Манро, Тімоті Уайт','Майкл Ллойд Грін, Грант Сп’ютор','Роуз Бірн, Хіларі Суонк, Клара Ругор, Люк Хокер, Тейл Стурзейкер'),
       ('Ігрища престолів','Вісім королівств ніколи не були дуже дружніми, але час від часу вони живуть мирно з єдиним королем. Зараз цю посаду займає сам Жирний король! Він вирішив зібрати найбільш авторитетних лордів на Бенкет очищення, щоб разом всіх їх замочити. Він сам хоче правити усім навколо, адже він же король. Звичайно ж, ніхто не підозрює про злий намір Жирного, як і той поняття не має, що його теж хочуть убити, при чому його же сім\'я. Та й самі гості Бенкету не прийшли тільки щоб веселиться, їм би теж хотілося перерізати кілька горлянок. Гори трупів, похіть та зради – це справжні Ігрища престолів.','50','1:25:00','комедія','12','2D','США','2019','Армандо Гутьеррез','Дж.Дж. Макдауелл, Даміан Ромей','Ангус Макфадьєн, Анна Гатчісон, Медісон МакКінлі, Адам Бонд, Карл Фаррер'),
       ('Клуб анонімних кілерів','Навіть у тих, хто заробляє собі на життя вбивствами, є власний клуб. В абсолютно секретному місці збирається певний Клуб анонімних кілерів, де дівчата та чоловіки дізнаються як можна пригнічувати їх пориви до жорстокості. Тут присутні абсолютно різні люди різного віку: лікар, святий отець, дівчинка-підліток й інші. Звичайно ж, у кімнаті, де на руках кожного море крові, довіряти нікому не можна. Зовсім недавно хтось із них був причетний до вбивства сенатора США, і тепер всі вони підозрюють один одного. Ці кілери навіть не уявляють, що вони давно пов\'язані роботою таємної організації. У кожного є вибір: убивати чи бути вбитим!','50','1:40:00','бойовик, детектив','16','2D','Великобританія','2019','Кірсті Белл','Сет Джонсон, Елізабет Морріс','Ґері Олдман, Джессіка Альба, Томмі Фленаґан, С\'юкі Вотерхаус, Сейді Фрост, Тім МакІннерні'),
       ('За мрією','Вайолет – сором\'язлива дівчина-підліток із маленького містечка, але з великою мрією: усе своє життя вона хоче знайти славу та стати популярною на всю країну. Найбільше на світі вона любить співати, сцена завжди вабила її до себе. На її життя випав чудовий шанс – участь у національному конкурсі "Teen spirit". Заручившись підтримкою досвідченого, але зовсім невдачливого наставника, Вайолет готова почати боротися зі своїми внутрішніми демонами, щоб стати популярною співачкою. Її талант, амбіції та готовність змінюватися будуть ретельно перевірені під наглядом досвідчених суддів. Заради своєї мрії Вайолет повинна стати абсолютно іншою, не забуваючи про внутрішнє Я.','50','1:32:00','драма, музика','16','3D','США, Великобританія','2019','Фред Бергер, Джеймі Белл','Макс Мінґелла','Елль Фаннінґ, Аґнешка Ґроховська, Арчі Мадекве, Златко Бурич, Міллі Брейді, Вівіан Опара, Ребекка Холл');
	   
INSERT INTO cinemadb . Timetable(`Time`,`Movie_id`,`Price`,`Visible`)
VALUES ('2019-07-03 15:00:00', '2','50','1'),
('2019-07-03 16:30:00', '5','50','1'),
('2019-07-03 18:00:00', '6','120','1'),
('2019-07-03 19:30:00', '7','120','1'),
('2019-07-03 21:00:00', '3','120','1'),
('2019-07-03 22:30:00', '1','120','1'),
('2019-07-04 09:00:00', '4','120','1'),
('2019-07-04 10:30:00', '8','120','1'),
('2019-07-04 12:00:00', '9','120','1');

INSERT INTO cinemadb . seats(`seatRow`,`seatCol`)
VALUES ('1','1'),
('1','2'),
('1','3'),
('1','4'),
('1','5'),
('1','6'),
('1','7'),
('1','8'),
('1','9'),
('1','10'),
('1','11'),
('1','12'),
('2','1'),
('2','2'),
('2','3'),
('2','4'),
('2','5'),
('2','6'),
('2','7'),
('2','8'),
('2','9'),
('2','10'),
('2','11'),
('2','12'),
('3','1'),
('3','2'),
('3','3'),
('3','4'),
('3','5'),
('3','6'),
('3','7'),
('3','8'),
('3','9'),
('3','10'),
('3','11'),
('3','12'),
('4','1'),
('4','2'),
('4','3'),
('4','4'),
('4','5'),
('4','6'),
('4','7'),
('4','8'),
('4','9'),
('4','10'),
('4','11'),
('4','12'),
('5','1'),
('5','2'),
('5','3'),
('5','4'),
('5','5'),
('5','6'),
('5','7'),
('5','8'),
('5','9'),
('5','10'),
('5','11'),
('5','12'),
('6','1'),
('6','2'),
('6','3'),
('6','4'),
('6','5'),
('6','6'),
('6','7'),
('6','8'),
('6','9'),
('6','10'),
('6','11'),
('6','12'),
('7','1'),
('7','2'),
('7','3'),
('7','4'),
('7','5'),
('7','6'),
('7','7'),
('7','8'),
('7','9'),
('7','10'),
('7','11'),
('7','12');

INSERT INTO cinemadb . users(`Login`,`Password`,`Role`,`FirstName`,`SecondName`,`Phone`,`Email`,`Cash`)
VALUES ('Labusyuk','5d6f33e137e50e0791248a840489c780','Admin','Vitaliy','Labusyuk','+380630461182','Labusyuk@gmail.com','999999999'),
('Epam','21232f297a57a5a743894a0e4a801fc3','Admin','Epam','System','+380443905457','Yuliia_Kashamova@epam.com','100000'),
('User1','b59c67bf196a4758191e42f76670ceba','User','Олександр','Списов','+380443905457','Yuliia_Kashamova@epam.com','60');
