Досвід роботи обмежується виконаними навчальними програмами: 

	-Курсова робота змійка (варта згадки як найперша).

	-Курсова робота "Система захисту" - система з двох програм(ключ - програма на android, замок - основна java програма) замок сканує мережу bluetooth. Користувач обирає доступний пристрій. Перевіряється наявність програми ключа, запитується дозвіл на надання доступу замку. Використовувалась готова бібліотека BlueCove.

	-Виконання навчального проекту Java EE Servlets, з використанням сесій, фільтрів, подій, JDBC, Log4j, JUnit, JSP. Знайомий з моделлю MVC.

	-Поміж цими проектами безліч виконаних дрібних лабораторних робіт мовою java.

Звичайно знайомий з ООП.

Виконавши завдання багато часу виділяю на його оформлення (розроблення графічного інтерфейсу навчальної програми). Звичайно найважливіша ефективність, але звичайні смєртні дивляться на візуалізацію. Люблю футбол. Біг. 